In [210]:
import pandas as pd
import numpy as np
import sklearn as sk
import seaborn as sns
import matplotlib.pyplot as plt

In [211]:
books=pd.read_csv("Books.csv", low_memory=False)
ratings=pd.read_csv('Ratings.csv')
users=pd.read_csv('Users.csv')

# Dataset Review

## Book dataset

In [212]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [213]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271359 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271357 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

Book-Author , Publisher, Image-URL-L has null values but as each ISBN is unique so can not drop na. Hence filling null values with "Unknown" for respective columns

In [214]:
len(books["ISBN"].unique())

271360

In [215]:
books.fillna(value="Unknown",inplace=True)

In [216]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271360 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271360 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271360 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

In [217]:
books[books["Image-URL-S"]=="http://images.amazon.com/images/P/185326119X.01.THUMBZZZ.jpg"]

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
21723,185326119X,The Jungle Book (Wordsworth Collection),Rudyard Kipling,1998,NTC/Contemporary Publishing Company,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/185326119X.0...
116461,185326119x,The Jungle Book (Wordsworth Collection),Rudyard Kipling,1998,NTC/Contemporary Publishing Company,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/185326119X.0...

In [218]:

books[books["Image-URL-S"]=="http://images.amazon.com/images/P/006099486X.01.THUMBZZZ.jpg"]

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
3591,006099486X,The Professor and the Madman: A Tale of Murder...,Simon Winchester,1999,Perennial,http://images.amazon.com/images/P/006099486X.0...,http://images.amazon.com/images/P/006099486X.0...,http://images.amazon.com/images/P/006099486X.0...
168738,006099486x,The Professor and the Madman: A Tale of Murder...,Simon Winchester,1999,Perennial,http://images.amazon.com/images/P/006099486X.0...,http://images.amazon.com/images/P/006099486X.0...,http://images.amazon.com/images/P/006099486X.0...

In [219]:
books['Image-URL-S'].value_counts()

http://images.amazon.com/images/P/185326119X.01.THUMBZZZ.jpg    2
http://images.amazon.com/images/P/006099486X.01.THUMBZZZ.jpg    2
http://images.amazon.com/images/P/044991089X.01.THUMBZZZ.jpg    2
http://images.amazon.com/images/P/086611873X.01.THUMBZZZ.jpg    2
http://images.amazon.com/images/P/039552105X.01.THUMBZZZ.jpg    2
                                                               ..
http://images.amazon.com/images/P/1860461050.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0553213067.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/156971634X.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/349223674X.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0767409752.01.THUMBZZZ.jpg    1
Name: Image-URL-S, Length: 271044, dtype: int64

In [220]:
books['Image-URL-L'].value_counts()

Unknown                                                         3
http://images.amazon.com/images/P/226401654X.01.LZZZZZZZ.jpg    2
http://images.amazon.com/images/P/140003065X.01.LZZZZZZZ.jpg    2
http://images.amazon.com/images/P/014062063X.01.LZZZZZZZ.jpg    2
http://images.amazon.com/images/P/039552105X.01.LZZZZZZZ.jpg    2
                                                               ..
http://images.amazon.com/images/P/1860461050.01.LZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0553213067.01.LZZZZZZZ.jpg    1
http://images.amazon.com/images/P/156971634X.01.LZZZZZZZ.jpg    1
http://images.amazon.com/images/P/349223674X.01.LZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0767409752.01.LZZZZZZZ.jpg    1
Name: Image-URL-L, Length: 271042, dtype: int64

It is found that few ISBN has duplicate values wherein difference is only in last character one is in small and other is in caps to remove duplicate Uppercasing all ISBN

In [221]:
upper_isbn= lambda x: x.upper()

In [222]:
trim_isbn=lambda x: x.strip()

In [223]:
books['ISBN']=books['ISBN'].astype('str')

In [224]:
# Trimming ISBN values
books["ISBN"]=books.ISBN.apply(trim_isbn)

In [225]:
#uppercasing ISBN values
books["ISBN"]=books.ISBN.apply(upper_isbn)

In [226]:
books.value_counts()

ISBN        Book-Title                                                                   Book-Author           Year-Of-Publication  Publisher                Image-URL-S                                                   Image-URL-M                                                   Image-URL-L
039543095X  Cultural Literacy: What Every American Needs to Know                         E. D. Hirsch Jr.      1987                 Houghton Mifflin         http://images.amazon.com/images/P/039543095X.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/039543095X.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/039543095X.01.LZZZZZZZ.jpg    2
044056428X  Nice Guys Sleep Alone: Dating in the Difficult Eighties                      Bruce Feirstein       1986                 Dell Publishing Company  http://images.amazon.com/images/P/044056428X.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/044056428X.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/044056428X.01.LZZZZZZZ.jpg    2
055334949X  Even Cowgirls Get the Blues                                                  Tom Robbins           1990                 Bantam                   http://images.amazon.com/images/P/055334949X.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/055334949X.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/055334949X.01.LZZZZZZZ.jpg    2
042507448X  Gods of Riverworld 5 (Riverworld Saga)                                       Philip Jose Farmer    1985                 Penguin Putnam~mass      http://images.amazon.com/images/P/042507448X.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/042507448X.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/042507448X.01.LZZZZZZZ.jpg    2
156205791X  Networking with Microsoft TCP/IP Certified Administrator's Resource Edition  Drew Heywood          1997                 New Riders Publishing    http://images.amazon.com/images/P/156205791X.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/156205791X.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/156205791X.01.LZZZZZZZ.jpg    2
                                                                                                                                                                                                                                                                                                                                                        ..
0441644511  The Outlaws of Sherwood                                                      Robin McKinley        1989                 Ace Books                http://images.amazon.com/images/P/0441644511.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441644511.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441644511.01.LZZZZZZZ.jpg    1
0441644651  Out of Phaze (Apprentice Adept (Paperback))                                  Piers Anthony         1994                 Ace Books                http://images.amazon.com/images/P/0441644651.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441644651.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441644651.01.LZZZZZZZ.jpg    1
0441644856  Out of the Times Abyss                                                       Edgar Rice Burroughs  1982                 Ace Books                http://images.amazon.com/images/P/0441644856.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441644856.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441644856.01.LZZZZZZZ.jpg    1
0441645712  The Oxygen Barons (Ace Science Fiction, No 12)                               Gregory Feeley        1990                 Ace Books                http://images.amazon.com/images/P/0441645712.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441645712.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441645712.01.LZZZZZZZ.jpg    1
B0002K6K8O  The Underground City                                                         Jules Verne           0                    Digireads.com            http://images.amazon.com/images/P/B0002K6K8O.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/B0002K6K8O.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/B0002K6K8O.01.LZZZZZZZ.jpg    1
Length: 271046, dtype: int64

In [227]:
## Removing duplicate entries
books.drop_duplicates(inplace=True)

In [228]:
books.value_counts()

ISBN        Book-Title                                                      Book-Author                    Year-Of-Publication  Publisher             Image-URL-S                                                   Image-URL-M                                                   Image-URL-L
0000913154  The Way Things Work: An Illustrated Encyclopedia of Technology  C. van Amerongen (translator)  1967                 Simon &amp; Schuster  http://images.amazon.com/images/P/0000913154.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0000913154.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0000913154.01.LZZZZZZZ.jpg    1
0812517008  Ripper                                                          Gardner Dozois                 1988                 Tor Books             http://images.amazon.com/images/P/0812517008.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0812517008.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0812517008.01.LZZZZZZZ.jpg    1
0812516648  The Nameless: Ramsey Campbell                                   Ramsey Campbell                1987                 Tor Books             http://images.amazon.com/images/P/0812516648.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0812516648.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0812516648.01.LZZZZZZZ.jpg    1
0812516680  The Parasite                                                    J. Ramsey Campbell             1989                 Tor Books (Mm)        http://images.amazon.com/images/P/0812516680.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0812516680.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0812516680.01.LZZZZZZZ.jpg    1
0812516702  Fine Frights                                                    Ramsey Campbell                1988                 Tor Books             http://images.amazon.com/images/P/0812516702.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0812516702.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0812516702.01.LZZZZZZZ.jpg    1
                                                                                                                                                                                                                                                                                                                                                 ..
0441533809  Mirror Friend/Foe                                               Robert Asprin                  1985                 Ace Books             http://images.amazon.com/images/P/0441533809.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441533809.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441533809.01.LZZZZZZZ.jpg    1
0441533825  Mirrorshades: The Cyberpunk Anthology                           Bruce Sterling                 1988                 Ace Books             http://images.amazon.com/images/P/0441533825.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441533825.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441533825.01.LZZZZZZZ.jpg    1
0441535038  The Mists of Doom                                               Robert E. Howard               1982                 Ace Books             http://images.amazon.com/images/P/0441535038.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441535038.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441535038.01.LZZZZZZZ.jpg    1
0441535046  The Mists of Doom (Cormac Mac Art Series, No 1)                 Andrew J. Offutt               1984                 Ace Books             http://images.amazon.com/images/P/0441535046.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/0441535046.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/0441535046.01.LZZZZZZZ.jpg    1
B0002K6K8O  The Underground City                                            Jules Verne                    0                    Digireads.com         http://images.amazon.com/images/P/B0002K6K8O.01.THUMBZZZ.jpg  http://images.amazon.com/images/P/B0002K6K8O.01.MZZZZZZZ.jpg  http://images.amazon.com/images/P/B0002K6K8O.01.LZZZZZZZ.jpg    1
Length: 271046, dtype: int64

In [229]:
books['Image-URL-S'].value_counts()

http://images.amazon.com/images/P/051513628X.01.THUMBZZZ.jpg    2
http://images.amazon.com/images/P/0385722206.01.THUMBZZZ.jpg    2
http://images.amazon.com/images/P/0195153448.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/1588454959.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0882732862.01.THUMBZZZ.jpg    1
                                                               ..
http://images.amazon.com/images/P/0871236583.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0440225914.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/8423309835.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/342378170X.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0767409752.01.THUMBZZZ.jpg    1
Name: Image-URL-S, Length: 271044, dtype: int64

In [230]:
books[books['ISBN']=='051513628X']

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
16202,051513628X,Key of Light (Key Trilogy (Paperback)),Nora Roberts,2003,Jove Books,http://images.amazon.com/images/P/051513628X.0...,http://images.amazon.com/images/P/051513628X.0...,http://images.amazon.com/images/P/051513628X.0...
213834,051513628X,Key of Light,Nora Roberts,2003,Jove Books,http://images.amazon.com/images/P/051513628X.0...,http://images.amazon.com/images/P/051513628X.0...,http://images.amazon.com/images/P/051513628X.0...

In [231]:
# Few ISBN still repeating as Book title is slightly different hence dropping duplicate values
books.drop(labels=16202, inplace=True)

In [232]:
books[books['ISBN']=='051513628X']

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
213834,051513628X,Key of Light,Nora Roberts,2003,Jove Books,http://images.amazon.com/images/P/051513628X.0...,http://images.amazon.com/images/P/051513628X.0...,http://images.amazon.com/images/P/051513628X.0...

In [233]:
books['Image-URL-S'].value_counts()

http://images.amazon.com/images/P/0385722206.01.THUMBZZZ.jpg    2
http://images.amazon.com/images/P/0195153448.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0439446171.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0439334039.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0345404939.01.THUMBZZZ.jpg    1
                                                               ..
http://images.amazon.com/images/P/0871236583.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0440225914.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/8423309835.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/342378170X.01.THUMBZZZ.jpg    1
http://images.amazon.com/images/P/0767409752.01.THUMBZZZ.jpg    1
Name: Image-URL-S, Length: 271044, dtype: int64

In [234]:
books['Image-URL-M'].value_counts()

http://images.amazon.com/images/P/0385722206.01.MZZZZZZZ.jpg    2
http://images.amazon.com/images/P/0195153448.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0439446171.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0439334039.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0345404939.01.MZZZZZZZ.jpg    1
                                                               ..
http://images.amazon.com/images/P/0871236583.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0440225914.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/8423309835.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/342378170X.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0767409752.01.MZZZZZZZ.jpg    1
Name: Image-URL-M, Length: 271044, dtype: int64

In [235]:
books[books['ISBN']=='03857222060']

Empty DataFrame
Columns: [ISBN, Book-Title, Book-Author, Year-Of-Publication, Publisher, Image-URL-S, Image-URL-M, Image-URL-L]
Index: []

In [236]:
books[books['ISBN']=='0385722206']

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
5248,0385722206,Balzac and the Little Chinese Seamstress : A N...,DAI SIJIE,2002,Anchor,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...

In [237]:
books['Image-URL-M'].value_counts()

http://images.amazon.com/images/P/0385722206.01.MZZZZZZZ.jpg    2
http://images.amazon.com/images/P/0195153448.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0439446171.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0439334039.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0345404939.01.MZZZZZZZ.jpg    1
                                                               ..
http://images.amazon.com/images/P/0871236583.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0440225914.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/8423309835.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/342378170X.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0767409752.01.MZZZZZZZ.jpg    1
Name: Image-URL-M, Length: 271044, dtype: int64

In [238]:
books[books['Image-URL-M']=='http://images.amazon.com/images/P/0385722206.01.MZZZZZZZ.jpg']

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
5248,0385722206,Balzac and the Little Chinese Seamstress : A N...,DAI SIJIE,2002,Anchor,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...
251649,0385722206 0,Balzac and the Little Chinese Seamstress : A N...,DAI SIJIE,2002,Anchor,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...

In [239]:
# Few ISBN still repeating as Book title is slightly different hence dropping duplicate values as shown above found ISBN 0385722206 is Valid ISBN hence dropping 03857222060
books.drop(labels=251649, inplace=True)

In [240]:
books[books['Image-URL-M']=='http://images.amazon.com/images/P/0385722206.01.MZZZZZZZ.jpg']

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
5248,0385722206,Balzac and the Little Chinese Seamstress : A N...,DAI SIJIE,2002,Anchor,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...

In [241]:
books['Image-URL-M'].value_counts()

http://images.amazon.com/images/P/0195153448.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0609800329.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0811202089.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0802133290.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0439334039.01.MZZZZZZZ.jpg    1
                                                               ..
http://images.amazon.com/images/P/158648009X.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0871236583.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0440225914.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/8423309835.01.MZZZZZZZ.jpg    1
http://images.amazon.com/images/P/0767409752.01.MZZZZZZZ.jpg    1
Name: Image-URL-M, Length: 271044, dtype: int64

In [242]:
books.shape

(271044, 8)

## Ratings dataset

In [243]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [244]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  int64
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  int64
dtypes: int64(2), object(1)
memory usage: 26.3+ MB

In [245]:
ratings["ISBN"]=ratings['ISBN'].apply(upper_isbn)
ratings['ISBN']=ratings['ISBN'].apply(trim_isbn)

In [246]:
ratings[ratings["User-ID"]==2]

      User-ID        ISBN  Book-Rating
9561        2  0195153448            0

In [247]:
ratings["User-ID"].value_counts()

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
116180        1
116166        1
116154        1
116137        1
276723        1
Name: User-ID, Length: 105283, dtype: int64

In [248]:
len(ratings["ISBN"].unique())

340215

In [249]:
import re

In [250]:
def remove_special_characters_and_extra_spaces(text):
    # Define a regular expression pattern to match symbols/special characters and extra white spaces
    pattern = r'[^a-zA-Z0-9\s]+|(?<=\s)\s+|\s+(?=\s )'

    # Use re.sub() to replace all matches with a single space
    cleaned_text = re.sub(pattern, '', text)

    # Remove leading and trailing spaces
    cleaned_text = cleaned_text.strip()
    pattern = r'\s+'
    cleaned_text = re.sub(pattern, '', cleaned_text)

    return cleaned_text

In [251]:
ratings.shape

(1149780, 3)

In [252]:
def count_values(data, column, new_column):
    value_counts = data[column].value_counts()
    value_counts=value_counts.reset_index(name=new_column).rename(columns={'index':column})
    return value_counts

In [253]:
value_counts = ratings["User-ID"].value_counts()
value_counts=value_counts.reset_index(name="Ratings_counts").rename(columns={'index':'User-ID'})
#value_counts.rename(columns={'index':'User-ID'})
value_counts

        User-ID  Ratings_counts
0         11676           13602
1        198711            7550
2        153662            6109
3         98391            5891
4         35859            5850
...         ...             ...
105278   116180               1
105279   116166               1
105280   116154               1
105281   116137               1
105282   276723               1

[105283 rows x 2 columns]

In [254]:
ratings_new=ratings.merge(value_counts, on='User-ID')

In [255]:
#ratings_new[ratings_new["User-ID"]]
ratings_new.shape

(1149780, 4)

In [256]:
ratings_new[ratings_new["Ratings_counts"]>=200]

         User-ID        ISBN  Book-Rating  Ratings_counts
1456      277427  002542730X           10             497
1457      277427  0026217457            0             497
1458      277427  003008685X            8             497
1459      277427  0030615321            0             497
1460      277427  0060002050            0             497
...          ...         ...          ...             ...
1147612   275970  3829021860            0            1376
1147613   275970  4770019572            0            1376
1147614   275970   896086097            0            1376
1147615   275970  9626340762            8            1376
1147616   275970  9626344990            0            1376

[527556 rows x 4 columns]

In [257]:
ratings_new[ratings_new['User-ID']==11676].head()

       User-ID            ISBN  Book-Rating  Ratings_counts
45326    11676      9022906116            7           13602
45327    11676  \0432534220\""            6           13602
45328    11676  \2842053052\""            7           13602
45329    11676   0 7336 1053 6            0           13602
45330    11676     0=965044153            7           13602

In [258]:
ratings_new['ISBN']=ratings_new['ISBN'].apply(remove_special_characters_and_extra_spaces)

In [259]:
len(count_values(ratings_new,"ISBN","ISBN_counts")["ISBN"].apply(remove_special_characters_and_extra_spaces).unique())

339899

In [260]:
ratings_new['ISBN']=ratings_new['ISBN'].apply(remove_special_characters_and_extra_spaces)

In [261]:
ratings_new[ratings_new['User-ID']==11676]

       User-ID         ISBN  Book-Rating  Ratings_counts
45326    11676   9022906116            7           13602
45327    11676   0432534220            6           13602
45328    11676   2842053052            7           13602
45329    11676   0733610536            0           13602
45330    11676   0965044153            7           13602
...        ...          ...          ...             ...
58923    11676   O77O428452            0           13602
58924    11676   O805063196            0           13602
58925    11676    O9088446X            8           13602
58926    11676   X000000000           10           13602
58927    11676  ZR903CX0003            1           13602

[13602 rows x 4 columns]

## User dataset

In [262]:
users=pd.read_csv('Users.csv')
users["Location"]=users.Location.apply(upper_isbn)

In [263]:
users.head(2)

   User-ID                   Location   Age
0        1         NYC, NEW YORK, USA   NaN
1        2  STOCKTON, CALIFORNIA, USA  18.0

In [264]:
def clean_data(text):
    # Define a regular expression pattern to match anything that is not a letter or digit
    pattern = r'[^a-zA-Z0-9\s]+'

    # Use re.sub() to replace all matches with an empty string
    cleaned_text = re.sub(pattern, '', text)

    return cleaned_text

In [265]:
location_split=lambda x: x.split(",")
location= lambda x: x[-3:]

In [266]:
user_location=pd.DataFrame(users["Location"].apply(location_split).apply(location).tolist())
user_location.head(2)

          0            1     2
0       NYC     NEW YORK   USA
1  STOCKTON   CALIFORNIA   USA

In [267]:
len(user_location[2].unique())

708

In [272]:
users["Location"].apply(clean_data)

0                         NYC NEW YORK USA
1                  STOCKTON CALIFORNIA USA
2            MOSCOW YUKON TERRITORY RUSSIA
3                    PORTO VNGAIA PORTUGAL
4         FARNBOROUGH HANTS UNITED KINGDOM
                        ...
278853                 PORTLAND OREGON USA
278854    TACOMA WASHINGTON UNITED KINGDOM
278855             BRAMPTON ONTARIO CANADA
278856             KNOXVILLE TENNESSEE USA
278857                   DUBLIN NA IRELAND
Name: Location, Length: 278858, dtype: object

In [268]:
user_location.rename(columns={0:"City",1:"State",2:"Country"}, inplace=True)
user_location.head(2)

       City        State Country
0       NYC     NEW YORK     USA
1  STOCKTON   CALIFORNIA     USA

In [273]:
user_location['City']=user_location['City'].apply(clean_data)
#user_location['State']=user_location['State'].apply(clean_data)
#user_location['Country']=user_location['Country'].apply(clean_data)

In [279]:
user_location["State"]=user_location["State"].astype("str")
user_location['State']=user_location['State'].apply(clean_data)

In [281]:
user_location["Country"]=user_location["Country"].astype("str")
user_location['Country']=user_location['Country'].apply(clean_data)

In [285]:
users.drop('Location', axis=1, inplace=True)
users[user_location.columns]=user_location
users.head(2)

   User-ID   Age      City        State Country
0        1   NaN       NYC     NEW YORK     USA
1        2  18.0  STOCKTON   CALIFORNIA     USA

In [286]:
len(users.Country.unique())

606

In [287]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   User-ID  278858 non-null  int64
 1   Age      168096 non-null  float64
 2   City     278858 non-null  object
 3   State    278858 non-null  object
 4   Country  278858 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 10.6+ MB

In [288]:
users[["Age","City","State","Country"]]=users[["Age","City","State","Country"]].fillna("NOT PROVIDED")

In [289]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   User-ID  278858 non-null  int64
 1   Age      278858 non-null  object
 2   City     278858 non-null  object
 3   State    278858 non-null  object
 4   Country  278858 non-null  object
dtypes: int64(1), object(4)
memory usage: 10.6+ MB

In [290]:
users

        User-ID           Age         City             State          Country
0             1  NOT PROVIDED          NYC          NEW YORK              USA
1             2          18.0     STOCKTON        CALIFORNIA              USA
2             3  NOT PROVIDED       MOSCOW   YUKON TERRITORY           RUSSIA
3             4          17.0        PORTO            VNGAIA         PORTUGAL
4             5  NOT PROVIDED  FARNBOROUGH             HANTS   UNITED KINGDOM
...         ...           ...          ...               ...              ...
278853   278854  NOT PROVIDED     PORTLAND            OREGON              USA
278854   278855          50.0       TACOMA        WASHINGTON   UNITED KINGDOM
278855   278856  NOT PROVIDED     BRAMPTON           ONTARIO           CANADA
278856   278857  NOT PROVIDED    KNOXVILLE         TENNESSEE              USA
278857   278858  NOT PROVIDED       DUBLIN                NA          IRELAND

[278858 rows x 5 columns]

#  Creating new data set using All 3 files data

In [291]:
ratings_new.head(2)

   User-ID        ISBN  Book-Rating  Ratings_counts
0   276725  034545104X            0               1
1   276726  0155061224            5               1

In [292]:
users.head(2)

   User-ID           Age      City        State Country
0        1  NOT PROVIDED       NYC     NEW YORK     USA
1        2          18.0  STOCKTON   CALIFORNIA     USA

In [293]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [304]:
""" ratings columns has max values also as we have multiple responses from each users on different books hence mergin significant columns from other dataset 
 to this for further processing.
 Significant columns from book dataset are "Book-Author", "Year-Of-Publication", "Publisher"  Note: Not utlizing book title because we already have ISBN
 and URL columns can be utilized during deployment as it only contains book images
 from User dataset utlizing user country city state and Age and location columns is transform into 3 seprate columns for better understanding."""
final=ratings_new.merge(books[['ISBN','Book-Author','Year-Of-Publication','Publisher']], on='ISBN')

In [295]:
final=final.merge(users, on='User-ID')

In [301]:

final["Book-Author"]=final["Book-Author"].apply(clean_data)
final["Publisher"]=final["Publisher"].apply(clean_data)

In [302]:
final

,User-ID,ISBN,Book-Rating,Ratings_counts,Book-Author,Year-Of-Publication,Publisher,Age,City,State,Country
0,276725,034545104X,0,1,M J Rose,2002,Ballantine Books,NOT PROVIDED,TYLER,TEXAS,USA
1,2313,034545104X,5,37,M J Rose,2002,Ballantine Books,23.0,CINCINNATI,OHIO,USA
2,2313,0812533550,9,37,Orson Scott Card,1986,Tor Books,23.0,CINCINNATI,OHIO,USA
3,2313,0679745580,8,37,TRUMAN CAPOTE,1994,Vintage,23.0,CINCINNATI,OHIO,USA
4,2313,0060173289,9,37,Rebecca Wells,1996,HarperCollins,23.0,CINCINNATI,OHIO,USA
...,...,...,...,...,...,...,...,...,...,...,...
1031467,276442,2862749796,7,4,Katherine Neville,2002,Le Cherche Midi,62.0,GENVE,GENVE,SWITZERLAND
1031468,276618,3788097000,5,1,Ludwig Marum,1984,CF Mller,NOT PROVIDED,STUTTGART,NA,GERMANY
1031469,276647,0553571001,0,2,L M Montgomery,2001,Starfire,13.0,ARLINGTON HEIGHTS,ILLINOIS,USA
1031470,276647,0689822294,10,2,Angela Johnson,1998,Simon amp Schuster Childrens Publishing,13.0,ARLINGTON HEIGHTS,ILLINOIS,USA
1031471,276660,0583307841,8,1,David Antony Kroft,1985,HarperCollins Publishers,15.0,SINGAPORE,NA,SINGAPORE